---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageAccessor.HasResolutions
source: html/cb368459-35e1-783e-1048-9b206e4511a3.htm
---
# Autodesk.Revit.DB.FailureMessageAccessor.HasResolutions Method

Checks if the failure has any resolutions.

## Syntax (C#)
```csharp
public bool HasResolutions()
```

## Returns
True if the failure has any resolutions, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This FailureMessageAccessor has not been properly initialized.